{
  "project": "hask-redis-mux",
  "branchName": "ralph/multiplexer-default",
  "description": "Make multiplexing the default behavior for standalone and cluster modes, add a standalone multiplexed client, and add comprehensive unit and E2E tests for the multiplexer subsystem.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create Standalone Multiplexed Client Module",
      "description": "As a library consumer, I want a standalone multiplexed Redis client so that I get pipelined throughput without needing cluster mode.",
      "acceptanceCriteria": [
        "New module StandaloneClient in lib/cluster/ that wraps a single Multiplexer for standalone Redis",
        "Provides createStandaloneClient, closeStandaloneClient, runStandaloneClient functions",
        "Implements the RedisCommands typeclass so all existing commands (GET, SET, MGET, DEL, HSET, LPUSH, ZADD, etc.) work",
        "Accepts a Connector and NodeAddress for connection setup",
        "Supports both plaintext and TLS connectors",
        "Re-exported from Redis.hs module",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Add Configuration for Standalone Client",
      "description": "As a library consumer, I want configuration options for the standalone multiplexed client so that I can tune behavior.",
      "acceptanceCriteria": [
        "StandaloneConfig data type with fields for: node address, connector, optional multiplexer count, and a useMultiplexing flag (default True)",
        "When useMultiplexing = False, falls back to existing RedisCommandClient behavior",
        "Config type is exported from Redis.hs",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Flip Cluster Multiplexing Default to True",
      "description": "As a library consumer, I want cluster mode to use multiplexing by default so that I get optimal throughput without extra configuration.",
      "acceptanceCriteria": [
        "ClusterConfig default or documentation indicates clusterUseMultiplexing defaults to True",
        "Existing clusterUseMultiplexing = False still works as opt-out",
        "All existing cluster E2E tests pass with the new default",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Unit Tests for Multiplexer Internals",
      "description": "As a developer, I want unit tests for the Multiplexer module so that I can verify slot allocation, command queuing, and response demultiplexing without a live Redis.",
      "acceptanceCriteria": [
        "New test suite MultiplexerSpec in hask-redis-mux.cabal",
        "Tests for SlotPool: allocation returns valid slot, return-and-reuse works, striped distribution across cores",
        "Tests for ResponseSlot: write-then-read returns correct value, waitSlot blocks until filled",
        "Tests for command queue batching: multiple enqueued commands are drained together",
        "Tests for multiplexer lifecycle: create, submit, destroy, submit-after-destroy throws MultiplexerDead",
        "Tests for isMultiplexerAlive reflecting actual state",
        "All tests pass (cabal test MultiplexerSpec)",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Unit Tests for MultiplexPool",
      "description": "As a developer, I want unit tests for MultiplexPool so that I can verify per-node multiplexer management and round-robin routing. I recognize that building/testing for the existing Pool tests might be timing out and i'll need to come up with a fix",
      "acceptanceCriteria": [
        "New test suite MultiplexPoolSpec in hask-redis-mux.cabal",
        "Tests for round-robin: sequential submits to same node rotate across multiplexers",
        "Tests for lazy creation: node muxes created on first access, not at pool creation",
        "Tests for multi-node routing: commands to different nodes use different multiplexers",
        "Tests for pool closure: closeMultiplexPool destroys all multiplexers",
        "All tests pass (cabal test MultiplexPoolSpec)",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "E2E Tests for Standalone Multiplexed Client",
      "description": "As a developer, I want E2E tests that exercise the standalone multiplexed client against a real Redis instance so that I can verify real-world behavior.",
      "acceptanceCriteria": [
        "New test module in test/LibraryE2E/StandaloneTests.hs or similar",
        "Tests for basic operations: SET, GET, DEL, MGET via standalone multiplexed client",
        "Tests for hash commands: HSET, HGET, HDEL",
        "Tests for list commands: LPUSH, RPUSH, LRANGE",
        "Tests for set commands: SADD, SMEMBERS",
        "Tests for sorted set commands: ZADD, ZRANGE",
        "Tests verify correct RESP responses (not just no-crash)",
        "Tests integrated into LibraryE2E executable",
        "All tests pass against a running Redis instance",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Concurrency and Stress Tests for Multiplexer",
      "description": "As a developer, I want stress tests that exercise the multiplexer under high concurrency so that I can verify thread safety and performance under load.",
      "acceptanceCriteria": [
        "Standalone concurrency test: 50+ threads doing concurrent SET/GET through a single multiplexer with no data corruption",
        "Cluster concurrency test with multiplexing enabled by default passes (existing ConcurrencyTests)",
        "Test that multiple multiplexers per node (MultiplexPool with count > 1) distribute load correctly",
        "Test that multiplexer handles rapid submit-after-destroy gracefully (throws, does not hang)",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Update Documentation and Exports",
      "description": "As a library consumer, I want the README and module documentation to reflect that multiplexing is now the default so that I understand the recommended usage.",
      "acceptanceCriteria": [
        "Redis.hs re-exports the new standalone client module",
        "hask-redis-mux.cabal lists new modules in the library exposed-modules and reexported-modules",
        "README.md updated with standalone multiplexed client usage example",
        "CHANGELOG.md updated with the new default behavior",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    }
  ]
}
